import classes from './styles/Header.module.css'
// import headerImg  from '../assets/header2.jpg'
const Header = () =>
{
    return (
        <header className={classes.header}>
            {/* <img src={headerImg} alt="" /> */}
            <div>
                <p>
                    مركز للحرف اليدوية هو مشروع تعليمي اقتصادي سياحي تجاري خاص بالحرف التقليدية واليدوية،
                    تعليمي حيث يتعلم سكان المنطقة المقام بها المشروع ومختلف الزوار من مختلف األماكن علي يد كبار
                    الحرفيين ، اقتصادي ، لوجود مجموعة من الورش المخصصة إلنتاج الصناعات اليدوية ومن ثم توفير
                    فرص عمل والحد من البطالة سياحي حيث توجد مناطق عرض مفتوحة ومغلقة بالمشروع لعرض
                    المنتجات المصنعة لجلب السياح إليها ، تجاري لوجود السوق الشعبي
                </p>
            </div>
        </header>
    )
}

export default Header