import './App.css';
import Header from './components/Header';
import Navbar from './components/Navbar';
import Section from './components/Section';
import furniture3 from './assets/furniture3.png'
import sweet2 from './assets/sweet2.jpg'
import handeMade from './assets/handeMade.png'
import Footer from './components/Footer';
import Gallery from './components/Gallery';
function App()
{
  return (
    <div>
      <Navbar />

      <Header />

      {/* furniture */}
      <Section>
        <div>
          <h3>
            القسم الاول : قسم الأثاث
          </h3>

          <img className='sm-img-section' src={furniture3} alt='القسم الاول : قسم الاثاث' />

          <h4>
            يُعّد قسم صناعة الأثاث في مركز تعليم الحرف اليدوية وجهة مثالية لمحبي اإلبداع
            والمهارة
            في هذا القسم، يُتيح المركز الفرصة للطالب لتعلم أساسيات صناعة الأثاث، بد ًءا من اختيار المواد
            الخام إلى التصميم والتجميع والتشطيب.
            يُقدم القسم مجموعة متنوعة من البرامج التعليمية، تناسب جميع المستويات، من المبتدئين إلى
            المتقدمين
          </h4>

          {/*  */}
          <h5>
            :أهداف قسم صناعة الأثاث
          </h5>
          <p>
            يهدف قسم صناعة الأثاث إلى: تعليم الطالب أساسيات صناعة الأثاث و تنمية مهاراتهم اإلبداعية
            والعملية و تزويدهم بالمعرفة والخبرة الالزمة للعمل في هذا المجال و إعدادهم ليكونوا حرفيين مهرة في
            صناعة الأثاث
          </p>

          {/*  */}
          <h5>
            :المناهج الدراسية في قسم صناعة الأثاث
          </h5>
          <p
            style={{ margin: "10px 0" }}
          >
            :يُقدم قسم صناعة الأثاث مجموعة متنوعة من المناهج الدراسية، تشمل
          </p>

          <p>
            <span>
              {`مبادئ صناعة الأثاث:`}
            </span>
            يُقدم هذا المنهج نظرة عامة على تاريخ صناعة الأثاث، وأنواع الأثاث المختلفة،
            والمواد الخام المستخدمة، وأدوات الصنعة
          </p>

          <p>
            <span>
              {`تصميم  الأثاث:`}
            </span>
            يُعلم هذا المنهج الطالب كيفية تصميم قطع أثاث مختلفة، باستخدام أدوات الرسم
            والتصميم الرقمي
          </p>

          <p>
            <span>
              {`نجارة الخشب:`}
            </span>
            يُعلم هذا المنهج الطالب كيفية استخدام أدوات النجارة المختلفة، مثل المنشار والمطرقة
            والمخرطة
          </p>

          <p>
            <span>
              {` التجميع والتشطيب:`}
            </span>
            يُعلم هذا المنهج الطالب كيفية تجميع قطع الأثاث المختلفة، ووضع التشطيبات
            النهائية عليها
          </p>

        </div>

        <img className='big-img-section' src={furniture3} alt='القسم الاول : قسم الاثاث' />
      </Section>

      {/* sweet */}
      <Section>
        <div>
          <h3>
            القسم الثانى : قسم الحلويات
          </h3>

          <img className='sm-img-section' src={sweet2} alt='القسم الثانى : قسم الحلويات' />

          <h4>
            في هذا القسم، يُتيح المركز الفرصة للطالب لتعلم فنون صناعة الحلويات المختلفة، من
            الحلويات الشرقية إلى الغربية، بد ًءا من اختيار المكونات إلى التحضير والتقديم.
            يُقدم القسم مجموعة متنوعة من البرامج التعليمية، تناسب جميع المستويات، من المبتدئين إلى
            المتقدمين
          </h4>

          {/*  */}
          <h5>
            :أهداف قسم صناعة الحلويات
          </h5>
          <p>
            يهدف قسم صناعة الحلويات إلى: تعليم الطالب فنون صناعة الحلويات المختلفة و تنمية مهاراتهم
            اإلبداعية والعملية و تزويدهم بالمعرفة والخبرة الالزمة للعمل في هذا المجال و إعدادهم ليكونوا طهاة
            حلويات مهرة
          </p>

          {/*  */}
          <h5>
            :المناهج الدراسية في قسم صناعة الحلويات
          </h5>
          <p
            style={{ margin: "10px 0" }}
          >
            :يُقدم قسم صناعة الحلويات مجموعة متنوعة من المناهج الدراسية، تشمل
          </p>

          <p>
            <span>
              {`أساسيات صناعة الحلويات:`}
            </span>
            يُقدم هذا المنهج نظرة عامة على أنواع الحلويات المختلفة، والمكونات
            المستخدمة، وأدوات الصنعة
          </p>

          <p>
            <span>
              {`صناعة الحلويات الشرقية:`}
            </span>
            يُعلم هذا المنهج الطالب كيفية صناعة الحلويات الشرقية المختلفة، مثل:
            مشبك و مدلعه و عزيزه و بسيمه و لديده و فوليه و سمسميه و حلوة الموسم وهريسة وبسيمة
            تزيين الحلويات: يُعلم هذا المنهج الطالب كيفية تزيين الحلويات بشكل جميل وجذاب
          </p>

          <h5>
            :مرافق قسم صناعة الحلويات
          </h5>
          <p>
            يُتوفر في قسم صناعة الحلويات جميع المرافق الالزمة لتعليم الطالب، تشمل
          </p>
          <p>مطابخ مجهزة بأدوات الطبخ الحديثة</p>
          <p>مختبرات لتصميم الحلويات</p>
          <p>معارض لعرض أعمال الطلاب</p>
        </div>

        <img className='big-img-section' src={sweet2} alt='القسم الثانى : قسم الحلويات' />
      </Section>

      {/* handmade */}
      <Section>
        <div>
          <h3>
            القسم الثالث : قسم المنسوجات
          </h3>

          <img className='sm-img-section' src={handeMade} alt='القسم الثالث : قسم المنسوجات' />

          <h4>
            في هذا القسم، يُتيح المركز الفرصة للطالب لتعلم فنون صناعة الملابس المختلفة، من
            تصميم الأزياء إلى الخياطة والتطريز، بد ًءا من اختيار األقمشة إلى التصميم والتقطيع
            والخياطة والتطريز
          </h4>
          <h4>
            يُقدم القسم مجموعة متنوعة من البرامج التعليمية، تناسب جميع المستويات، من المبتدئين إلى
            المتقدمين
          </h4>

          {/*  */}
          <h5>
            :أهداف قسم صناعة الملابس
          </h5>
          <p>
            يهدف قسم صناعة الملابس إلى: تعليم الطالب فنون صناعة الملابس المختلفة و تنمية مهاراتهم
            اإلبداعية والعملية و تزويدهم بالمعرفة والخبرة الالزمة للعمل في هذا المجال و إعدادهم ليكونوا
            مصممين ومخيطين مهرة
          </p>

          {/*  */}
          <h5>
            :المناهج الدراسية في قسم صناعة الملابس
          </h5>
          <p
            style={{ margin: "10px 0" }}
          >
            :يُقدم قسم صناعة الملابس مجموعة متنوعة من المناهج الدراسية، تشمل
          </p>

          <p>
            <span>
              {`أساسيات صناعة الملابس:`}
            </span>
            يُقدم هذا المنهج نظرة عامة على أنواع الملابس المختلفة، والمواد
            المستخدمة، وأدوات الخياطة
          </p>

          <p>
            <span>
              {`تصميم الأزياء:`}
            </span>
            يُعلم هذا المنهج الطالب كيفية تصميم الملابس بشكل جميل وجذاب، باستخدام أدوات
            الرسم والتصميم الرقمي
          </p>
          <p>
            <span>
              {`الخياطة:`}
            </span>
            يُعلم هذا المنهج الطالب كيفية استخدام آلة الخياطة، وكيفية تقطيع وخياطة الملابس المختلفة
          </p>
          <p>
            <span>
              {`التطريز:`}
            </span>
            يُعلم هذا المنهج الطالب كيفية تطريز الملابس بشكل جميل وجذاب
          </p>
          <p
            style={{ margin: "10px 0" }}
          >
            :تُقدم بعض المناهج الدراسية أي ًضا تركي ًزا على مهارات محددة، مثل
            <br />
            صناعة الملابس الرجالية و صناعة الملابس النسائية و صناعة مالبس األطفال
          </p>

          <h5>
            :مرافق قسم صناعة الملابس
          </h5>
          <p>
            يُتوفر في قسم صناعة الملابس جميع المرافق الالزمة لتعليم الطالب، تشمل:
            <br />
            ورش عمل مجهزة بآالت الخياطة الحديثة و مختبرات لتصميم الأزياء ومعارض لعرض أعمال
            الطلاب
          </p>
        </div>

        <img className='big-img-section' src={handeMade} alt='القسم الثالث : قسم المنسوجات' />
      </Section>

      {/* gallery section*/}
      <Section>
        <div>
          <h3>
            القسم الرابع : المعرض
          </h3>

          <h4>
            يُتيح المعرض للطالب فرصة عرض منتجاتهم للجمهور، والترويج لمهاراتهم، والحصول
            على ردود فعل إيجابية من الزوار
          </h4>

          {/*  */}
          <h5>
            :أهداف معرض عرض المنتجات
          </h5>
          <p>
            يهدف معرض عرض المنتجات إلى: عرض إبداعات الطالب ومهاراتهم في مختلف الحرف اليدوية و
            ترويج مركز تعليم الحرف اليدوية وأنشطته و تشجيع الطالب على االستمرار في التعلم واإلبداع و خلق
            فرص جديدة للطالب لبيع منتجاتهم و دعم الحرف اليدوية والحفاظ عليها
          </p>

          {/*  */}
          <h5>
            :ما يتم عرضه في المعرض
          </h5>
          <p
            style={{ margin: "10px 0" }}
          >
            :يُعرض في المعرض مجموعة متنوعة من المنتجات المصنوعة يدويًا، تشمل
          </p>
          <p
            style={{ margin: "10px 0" }}
          >
            منتجات صناعة الأثاث ومنتجات صناعة الحلويات ومنتجات صناعة الملابس
          </p>
        </div>

      </Section>

      <Gallery/>

      <Footer />
    </div>
  );
}

export default App;
